Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: These goals are achieved by the handshake protocol, which can be summarized as follows: The client sends a ClientHello message to which the server must respond with a ServerHello message, or else a fatal error will occur and the connection will fail.
zh_cn: 这些目标是通过握手协议实现的，可以概括如下：客户端发送 ClientHello 消息，服务器必须使用 ServerHello 消息响应该消息，否则将发生致命错误并且连接将失败。

source: These guidelines are intended to improve HTTP response times and avoid congestion.
zh_cn: 这些准则旨在改善 HTTP 响应时间并避免拥塞。

source: These header fields apply only to the message being transmitted.
zh_cn: 这些首部字段仅适用于正在传输的消息。

source: These header fields give information about the server and about further access to the resource identified by the Request-URI.
zh_cn: 这些首部字段提供有关服务器的信息以及有关 Request-URI 标识的资源的进一步访问。

source: These header fields give information about the server, about further access to the target resource, or about related resources.
zh_cn: 这些首部字段提供有关服务器，有关对目标资源的进一步访问或相关资源的信息。

source: These include national hierarchies of proxy caches to save transoceanic bandwidth, collaborative systems that broadcast or multicast cache entries, archives of pre-fetched cache entries for use in off-line or high-latency environments, and so on.
zh_cn: 这些包括用于保存跨洋带宽的代理高速缓存的国家层次结构，用于广播或多播高速缓存条目的协作系统，用于离线或高延迟环境的预取高速缓存条目的存档等。

source: These include uppercase and lowercase letters, decimal digits, hyphen, period, underscore, and tilde.
zh_cn: 这些包括大写和小写字母，十进制数字，连字符，句点，下划线和波浪号。

source: These independent connections may occur sequentially or simultaneously; a SessionID becomes valid when the handshake negotiating it completes with the exchange of Finished messages and persists until it is removed due to aging or because a fatal error was encountered on a connection associated with the session.
zh_cn: 这些独立的连接可以顺序或同时发生；当协商 SessionID 的握手交换 Finished 消息完成后，SessionID 变为有效，并且持续存在，直到由于老化或因与会话关联的连接遇到致命错误而将其删除。

source: These instruct the operator to do some or all of its work on a particular Scheduler.
zh_cn: 这会指示操作符在特定的调度器上完成部分或全部工作。

source: These interfaces are, however, not standard in the sense of the Reactive Streams specification and are currently RxJava specific only.
zh_cn: 但是，这些接口在 Reactive Streams 规范的意义上并不是标准的，并且目前仅针对 RxJava。

source: These items are then used to create security parameters for use by the record layer when protecting application data.
zh_cn: 然后使用这些项创建安全参数，供记录层在保护应用程序数据时使用。

source: These link to the page that documents the core operator that most closely resembles the language-specific operator (so, for instance, the Rx.NET “SelectMany” operator links to the documentation of the FlatMap ReactiveX operator, of which “SelectMany” is the Rx.NET implementation).
zh_cn: 这些链接到记录核心操作符的页面，该核心操作符最类似于特定于语言的操作符（例如，Rx.NET “SelectMany” 操作符链接到 FlatMap ReactiveX 操作符的文档，其中“SelectMany”是 Rx.NET 实现。

source: These messages are encrypted under keys derived from the [sender]_handshake_traffic_secret.
zh_cn: 这些消息在从 [sender]_handshake_traffic_secret 派生的密钥下加密。

source: These messages are encrypted with keys derived from the server_handshake_traffic_secret.
zh_cn: 这些消息使用从 server_handshake_traffic_secret 派生的密钥加密。

source: These messages use a handshake content type and are encrypted under the appropriate application traffic key.
zh_cn: 这些消息使用握手内容类型，并在适当的应用程序通信密钥下加密。

source: These methods allow only a single resource to be associated with the emitter at a time and setting a new one unsubscribes the old one automatically.
zh_cn: 这些方法一次只允许一个源与 emitter 相关联，并且设置一个新资源会自动取消订阅旧资源。

source: These methods ought to be considered "safe".
zh_cn: 这些方法应该被认为是“安全的 (safe)”。

source: These pages include information about some operators that are not part of the core of ReactiveX but are implemented in one or more of language-specific implementations and/or optional modules.
zh_cn: 这些页面包含的一些操作符的信息，这些操作符不属于 ReactiveX 的核心，而是在一个或多个特定于语言的实现和/或可选模块中实现。

source: These parameters are defined in the presentation language as:
zh_cn: 这些参数在表示语言中定义为：

source: These patterns also allow you to chain the methods in a similar way.
zh_cn: 这些模式也允许您以类似的方式链接方法。

source: These properties should be true even in the face of an attacker who has complete control of the network, as described in [RFC3552].
zh_cn: 即使面对完全控制网络的攻击者，这些属性也应该是正确的，如 [RFC3552] 中所述。

source: These requirements allow HTTP's functionality to be enhanced without requiring prior update of deployed intermediaries.
zh_cn: 这些要求允许增强 HTTP 的功能，而无需事先更新已部署的中介。

source: These requirements are a superset of those needed to perform a 1-RTT handshake using the PSK in question.
zh_cn: 这些要求是使用相关 PSK 执行 1-RTT 握手所需的超集。

source: These restrictions exist in order to preserve the self-delimiting nature of a multipart message- body, wherein the "end" of the message-body is indicated by the ending multipart boundary.
zh_cn: 存在这些限制是为了保持多部分消息体的自定界性质，其中消息体的“结束”由结束的多部分边界指示。

source: These restrictions result in five different ABNF rules for a path (Section 3.3), only one of which will match any given URI reference.
zh_cn: 这些限制导致路径的五个不同的 ABNF 规则(第 3.3 节)，其中只有一个匹配任何给定的 URI 引用。

source: These rules allow the recipient to determine the transfer-length of the message (section 4.4).
zh_cn: 这些规则允许收件人确定邮件的传输长度(第 4.4 节)。

source: These special characters MUST be in a quoted string to be used within a parameter value (as defined in section 3.6).
zh_cn: 这些特殊字符必须位于引用的字符串中，以便在参数值中使用(如第 3.6 节中所定义)。

source: These systems include national hierarchies of proxy caches to save transoceanic bandwidth, systems that broadcast or multicast cache entries, organizations that distribute subsets of cached data via CD-ROM, and so on.
zh_cn: 这些系统包括用于保存跨洋带宽的代理缓存的国家层次结构，用于广播或多播缓存条目的系统，通过 CD-ROM 分发缓存数据子集的组织等。

source: These terms should not be mistaken as an assumption that an identifier defines or embodies the identity of what is referenced, though that may be the case for some identifiers.
zh_cn: 这些术语不应该被误认为是标识符定义或体现所引用内容的标识的假设，尽管某些标识符可能就是这种情况。

source: These values refer solely to signatures which appear in certificates (see Section 4.4.2.2) and are not defined for use in signed TLS handshake messages, although they MAY appear in "signature_algorithms" and "signature_algorithms_cert" for backward compatibility with TLS 1.2.
zh_cn: 这些值仅指出现在证书中的签名(参见第 4.4.2.2 节)，并且未定义用于签名的 TLS 握手消息，尽管它们可能出现在“signature_algorithms”和“signature_algorithms_cert”中，以便与 TLS 1.2 向后兼容。

source: They MUST NOT be offered or negotiated by any implementation.
zh_cn: 任何实现都不得提供或协商。

source: They MUST NOT be used for advertising or other non-essential information.
zh_cn: 它们不得用于广告或其他非必要信息。

source: They are distinct namespaces and are considered to be distinct origin servers.
zh_cn: 它们是不同的名称空间，被认为是不同的源服务器。

source: They are intended for use at the beginning of a relative-path reference (Section 4.2) to indicate relative position within the hierarchical tree of names.
zh_cn: 它们旨在用于相对路径引用(第 4.2 节)的开头，以指示名称的分层树中的相对位置。

source: They are naturally efficient because they execute when the response is ready.
zh_cn: 它们自然有效，因为它们在响应准备就绪时执行。

source: They are now deprecated and will be documented in a separate document.
zh_cn: 它们现已弃用，将记录在单独的文档中。

source: They are purely to allow broad testing and feedback.
zh_cn: 它们纯粹是为了进行广泛的测试和反馈。

source: They can be modified in any way, or even removed, at any time.
zh_cn: 它们可以随时以任何方式进行修改，甚至可以删除。

source: They were used in SSLv3.
zh_cn: 它们用于 SSLv3。

source: They will have different group ids (`io.reactivex.rxjava2` vs `io.reactivex`) and namespaces (`io.reactivex` vs `rx`).
zh_cn: 他们将拥有不同的组 ID (`io.reactivex.rxjava2` vs `io.reactivex`) 和名称空间 (`io.reactivex` vs `rx`)。

source: This "selected representation" is used to provide the data and metadata for evaluating conditional requests [RFC7232] and constructing the payload for 200 (OK) and 304 (Not Modified) responses to GET (Section 4.3.1).
zh_cn: 这个“选定表示”用于提供数据和元数据，用于评估条件请求 [RFC7232] 和构建 200(OK)和 304(未修改)对 GET 响应的有效载荷(第 4.3.1 节)。

source: This can be done, of course, but it quickly becomes complicated (and thus error-prone) or it prematurely blocks on Future.get(), which eliminates the benefit of asynchronous execution.
zh_cn: 当然，这 可以实现，但它很快变得复杂(因而容易出错)或者过早地阻塞了 Future.get()，这消除了异步执行的优势。

source: This HTTP/1.1 specification obsoletes RFC 2616 and RFC 2145 (on HTTP versioning).
zh_cn: 此 HTTP/1.1 规范废弃了 RFC 2616 和 RFC 2145(关于 HTTP 版本控制)。

source: This Internet-Draft is submitted in full conformance with the provisions of BCP 78 and BCP 79.
zh_cn: 该互联网草案的提交完全符合 BCP 78 和 BCP 79 的规定。

source: This Internet-Draft will expire on November 30, 2019.
zh_cn: 此互联网草案将于 2019 年 11 月 30 日到期。

source: This PRF with the SHA-256 hash function is used for all cipher suites defined in this document and in TLS documents published prior to this document when TLS 1.2 is negotiated.
zh_cn: 这个带有 SHA-256 散列函数的 PRF 用于本文档中定义的所有密码套件，以及本文档之前发布的 TLS 文档如果协商为 TLS 1.2。

source: This SHOULD be the latest (highest valued) version supported by the client.
zh_cn: 这应该是客户支持的最新(最高值)版本。

source: This SHOULD only be done when the application knows (typically through detecting HTTP message boundaries) that it has received all the message data that it cares about.
zh_cn: 只有当应用程序知道(通常通过检测 HTTP 消息边界)它已经接收到它关心的所有消息数据时，才应该这样做。

source: This Scheduler has three additional methods:
zh_cn: 此调度器还有三种方法：

source: This alert also MUST be returned if an alert is sent because a TLSCiphertext decrypted in an invalid way: either it wasn't an even multiple of the block length, or its padding values, when checked, weren't correct.
zh_cn: 如果发送的警报是因为 TLSCiphertext 以无效方式解密，则必须返回此警报：或者它不是块长度的偶数倍，或者在检查时其填充值不正确。

source: This alert is always fatal and should never be observed in communication between proper implementations.
zh_cn: 此警报始终是致命的，在正确实现之间的通信中永远不应该遵守。

source: This alert is returned if a record is received with an incorrect MAC.
zh_cn: 如果收到的 MAC 记录不正确，则会返回此警报。

source: This alert should be followed by a close_notify.
zh_cn: 此警报后面应该是 close_notify。

source: This alert was used in SSLv3 but not any version of TLS.
zh_cn: 此警报在 SSLv3 中使用，但未在任何版本的 TLS 中使用。

source: This alert was used in some earlier versions of TLS, and may have permitted certain attacks against the CBC mode [CBCATT].
zh_cn: 此警报在某些早期版本的 TLS 中使用，并且可能允许某些针对 CBC 模式的攻击 [CBCATT]。

source: This alert was used in some earlier versions of TLS.
zh_cn: 此警报用于某些早期版本的 TLS。

source: This allows a connection to be upgraded to protocols with the same semantics as HTTP without the latency cost of an additional round trip.
zh_cn: 这允许将连接升级到具有与 HTTP 相同语义的协议，而无需额外往返的延迟成本。

source: This allows constraining the memory usage of the dataflows in situations where there is generally no way for a step to know how many items the upstream will send to it.
zh_cn: 这允许在通常无法知道上游将向其发送多少项的步骤的情况下约束数据流的存储器使用。

source: This allows creating stream consumers with less internal state than the quite heavy `rx.Subscriber` of 1.x.
zh_cn: 这允许创建具有比 1.x 的非常重​​的 `rx.Subscriber` 更少的内部状态的流消费者。

source: This allows dynamically produced content to be transferred along with the information necessary for the recipient to verify that it has received the full message.
zh_cn: 这允许动态生成的内容与接收方验证其已收到完整消息所需的信息一起传输。

source: This allows for efficient execution and composition.
zh_cn: 这些操作符让执行和复合变得非常高效。

source: This allows the client to avoid having to compute partial hash transcripts for multiple hashes in the second ClientHello.
zh_cn: 这允许客户端避免在第二个 ClientHello 中计算多个哈希的部分哈希转录本。

source: This allows user agents to represent other methods, such as POST, PUT and DELETE, in a special way, so that the user is made aware of the fact that a possibly unsafe action is being requested.
zh_cn: 这允许用户代理以特殊方式表示其他方法，例如 POST，PUT 和 DELETE，以便使用户意识到正在请求可能不安全的操作。

source: This allows you to apply these operators one after the other, in a chain.
zh_cn: 这允许您在链中一个接一个地应用这些操作符。

source: This alone does not guarantee that old duplicate data is drained from the net, so the sequence space has been made very large to reduce the probability that a wandering duplicate will cause trouble upon arrival.
zh_cn: 仅这一点并不能保证从网络中排出旧的重复数据，因此序列空间已经非常大，以减少流浪复制品在到达时会造成麻烦的可能性。

source: This approach is more flexible, because values can arrive synchronously or asynchronously.
zh_cn: 这种方法更灵活，因为值可以同步或异步到达。

source: This authentication can be made optional, but is generally required for at least one of the peers.
zh_cn: 该认证可以是可选的，但是对于至少一个对等端通常是必需的。

source: This behavior differs from 1.x where a `request` call went through a deferred logic that accumulated requests until an upstream `Producer` arrived at some time (This nature adds overhead to all operators and consumers in 1.x.) In 2.x, there is always a `Subscription` coming down first and 90% of the time there is no need to defer requesting.
zh_cn: 这种行为不同于 1.x，其中 `request` 调用通过延迟逻辑累积请求，直到上游 `Producer` 在某个时间到达(这种性质增加了 1.x 中所有运算符和消费者的开销)。在 2.x 中，总是有一个 `Subscription` 首先出现，90% 的时间不需要延迟请求。

source: This byte ordering for multi-byte values is the commonplace network byte order or big-endian format.
zh_cn: 多字节值的这种字节排序是常见的网络字节顺序或大端格式。

source: This callback is executed as many times as the downstream requested.
zh_cn: 此回调的执行次数与下游请求的次数相同。

source: This can be achieved by moving the outer `flatMap` into the inner parts of the previous `flatMap` for example:
zh_cn: 这可以通过将外部 `flatMap` 移动到前一个 `flatMap` 的内部部分来实现，例如：

source: This can be used, for example, to have a larger but still fixed pool of threads (unlike `computation()` and `io()` respectively).
zh_cn: 例如，这可用于拥有更大但仍然固定的线程池(分别与 `calculation()` 和 `io()` 不同)。

source: This can be useful for testing interactions that depend on precise arrangements of actions in time.
zh_cn: 这对于测试依赖于及时精确的动作安排的交互是有用的。

source: This can be useful in some telemetry-like situations where the data may come in some bursty pattern but only the very latest is interesting for processing.
zh_cn: 这在类似遥测的情况下非常有用，在这种情况下，数据可能会以某种突发模式出现，但只有最新的数据才会对处理感兴趣。

source: This can get also ambiguous when functional interface types get involved as the type argument `T`.
zh_cn: 当函数接口类型作为类型参数 `T` 参与时，这也会变得有歧义。

source: This can have the effect of making the resulting Subject a “hot” Observable variant of the original “cold” Observable.
zh_cn: 这可以使得到的 Subject 成为原始“冷” Observable 的“热” Observable 变体。

source: This check ensures that the remote peer is properly behaved and isn't forcing the local system into a small subgroup.
zh_cn: 此检查可确保远程对等端正确运行，并且不会将本地系统强制转换为小型子组。

source: This content-coding is used only in the Accept-Encoding header, and SHOULD NOT be used in the Content-Encoding header.
zh_cn: 此内容编码仅在 Accept-Encoding 首部中使用，并且不应在 Content-Encoding 首部中使用。

source: This data is not forward secret, as it is encrypted solely under keys derived using the offered PSK.
zh_cn: 该数据不是前向保密信息，因为它仅在使用提供的 PSK 导出的密钥下加密。

source: This data is transparent and treated as an independent block to be dealt with by the higher-level protocol specified by the type field.
zh_cn: 该数据是透明的，并被视为一个独立的块，由类型字段指定的更高级协议处理。

source: This decouples the evolution of identification schemes from the evolution of protocols, data formats, and implementations that make use of URIs.
zh_cn: 这使得识别方案的演变与使用 URI 的协议，数据格式和实现的演变分离。

source: This definition is intended to allow various kinds of character encoding, from simple single-table mappings such as US-ASCII to complex table switching methods such as those that use ISO-2022's techniques.
zh_cn: 此定义旨在允许各种字符编码，从简单的单表映射(如 US-ASCII)到复杂的表切换方法(如使用 ISO-2022 技术的那些)。

source: This definition of safe methods does not prevent an implementation from including behavior that is potentially harmful, that is not entirely read-only, or that causes side effects while invoking a safe method.
zh_cn: 安全方法的这种定义并不妨碍实现包含可能有害的行为，不完全是只读的行为，或者在调用安全方法时导致副作用。

source: This diagram explains how Singles are represented in marble diagrams:
zh_cn: 此图解释了 Single 如何在 marble 图中表示：

source: This differs from a content coding in that the transfer-coding is a property of the message, not of the original entity.
zh_cn: 这与内容编码的不同之处在于，传输编码是消息的属性，而不是原始实体的属性。

source: This distinction is important because some HTTP communication options may apply only to the connection with the nearest, non-tunnel neighbor, only to the end-points of the chain, or to all connections along the chain.
zh_cn: 这种区别很重要，因为某些 HTTP 通信选项可能仅适用于与最近的非隧道邻居的连接，仅适用于链的端点或链中的所有连接。

source: This division allows for the existence of host level protocols other than TCP.
zh_cn: 这种划分允许存在除 TCP 之外的主机级协议。

source: This document also defines representation metadata that describe how a payload is intended to be interpreted by a recipient, the request header fields that might influence content selection, and the various selection algorithms that are collectively referred to as "content negotiation" (Section 3.4).
zh_cn: 本文档还定义了表示元数据，描述了接收者如何解释有效载荷，可能影响内容选择的请求首部字段，以及统称为“内容协商”的各种选择算法(第 3.4 节)。

source: This document also specifies new requirements for TLS 1.2 implementations.
zh_cn: 本文档还规定了 TLS 1.2 实现的新要求。

source: This document and the TLS protocol itself are based on the SSL 3.0 Protocol Specification as published by Netscape.
zh_cn: 本文档和 TLS 协议本身基于 Netscape 发布的 SSL 3.0 协议规范。

source: This document deals with the formatting of data in an external representation.
zh_cn: 本文档涉及外部表示中数据的格式。

source: This document defines HTTP/1.1 request and response semantics in terms of the architecture defined in [RFC7230].
zh_cn: 本文档根据 [RFC7230] 中定义的体系结构定义 HTTP/1.1 请求和响应语义。

source: This document defines TLS version 1.3.
zh_cn: 本文档定义了 TLS 1.3 版。

source: This document defines a grammar that is a superset of all valid URI, such that an implementation can parse the common components of a URI reference without knowing the scheme-specific requirements of every possible identifier type.
zh_cn: 本文档定义了一个语法，它是所有有效 URI 的超集，因此实现可以解析 URI 引用的公共组件，而无需了解每种可能的标识符类型的特定于方案的要求。

source: This document defines matching rules for two standard certificate extensions defined in [RFC5280]:
zh_cn: 本文档定义了 [RFC5280] 中定义的两个标准证书扩展的匹配规则：

source: This document defines several changes that optionally affect implementations of TLS 1.2, including those which do not also support TLS 1.3:
zh_cn: 本文档定义了一些可选择地影响 TLS 1.2 实现的更改，包括那些不支持 TLS 1.3 的更改：

source: This document defines the generic syntax of URI, including both absolute and relative forms, and guidelines for their use; it revises and replaces the generic definitions in RFC 1738 and RFC 1808.
zh_cn: 本文档定义了 URI 的通用语法，包括绝对和相对形式，以及它们的使用指南；它修改并替换了 RFC 1738 和 RFC 1808 中的通用定义。

source: This document defines the semantics of HTTP/1.1 messages, as expressed by request methods, request header fields, response status codes, and response header fields, along with the payload of messages (metadata and body content) and mechanisms for content negotiation.
zh_cn: 本文档定义了 HTTP/1.1 消息的语义，如请求方法，请求首部字段，响应状态代码和响应首部字段，以及消息的有效载荷(元数据和正文内容)以及内容协商机制所表示的。

source: This document describes TLS 1.3, which uses the version 0x0304.
zh_cn: 本文档描述了 TLS 1.3，它使用版本 0x0304。

source: This document describes TLS Version 1.2, which uses the version { 3, 3 }.
zh_cn: 本文档描述了 TLS 版本 1.2，它使用版本 { 3, 3 }。

source: This document describes how to use HTTP over TLS.
zh_cn: 本文档介绍如何使用 HTTP over TLS。

source: This document describes the architectural elements that are used or referred to in HTTP, defines the "http" and "https" URI schemes, describes overall network operation and connection management, and defines HTTP message framing and forwarding requirements.
zh_cn: 本文档描述了在 HTTP 中使用或引用的体系结构元素，定义了“http”和“https”URI 方案，描述了整体网络操作和连接管理，并定义了 HTTP 消息成帧和转发要求。

source: This document documents that practice using TLS.
zh_cn: 本文档记录了使用 TLS 的练习。

source: This document does not define a generative grammar for URI; that task will be performed by the individual specifications of each URI scheme.
zh_cn: 本文档没有定义 URI 的生成语法；该任务将由每个 URI 方案的各个规范执行。

source: This document does not discuss the issues and recommendation for dealing with characters outside of the US-ASCII character set [ASCII]; those recommendations are discussed in a separate document.
zh_cn: 本文档不讨论处理 US-ASCII 字符集 [ASCII] 之外的字符的问题和建议；这些建议将在另一份文件中讨论。

source: This document is a product of the Internet Engineering Task Force (IETF).
zh_cn: 本文档是互联网工程任务组(IETF)的产品。

source: This document is a revision of the TLS 1.1 [TLS1.1] protocol which contains improved flexibility, particularly for negotiation of cryptographic algorithms.
zh_cn: 本文档是 TLS 1.1 [TLS1.1] 协议的修订版，该协议包含更高的灵活性，特别是对于加密算法的协商。

source: This document is intended primarily for readers who will be implementing the protocol and for those doing cryptographic analysis of it.
zh_cn: 本文档主要面向将要实现协议的读者以及对其进行加密分析的读者。

source: This document is not intended to supply any details of service definition or of interface definition, although it does cover select areas of policy as they are required for the maintenance of solid security.
zh_cn: 本文档并不打算提供服务定义或接口定义的任何详细信息，尽管它确实涵盖了一些策略领域，因为它们是维护可靠安全性所必需的。

source: This document is the first in a series of documents that collectively form the HTTP/1.1 specification:
zh_cn: 本文档是一系列文档中的第一个，它们共同构成了 HTTP/1.1 规范：

source: This document obsoletes [RFC2396], which merged "Uniform Resource Locators" [RFC1738] and "Relative Uniform Resource Locators" [RFC1808] in order to define a single, generic syntax for all URIs.
zh_cn: 本文档废弃 [RFC2396]，它合并了“统一资源定位符”[RFC1738] 和“相对统一资源定位符”[RFC1808]，以便为所有 URI 定义单个通用语法。

source: This document provides an overview of HTTP architecture and its associated terminology, defines the "http" and "https" Uniform Resource Identifier (URI) schemes, defines the HTTP/1.1 message syntax and parsing requirements, and describes related security concerns for implementations.
zh_cn: 本文档概述了 HTTP 体系结构及其相关术语，定义了“http”和“https”统一资源标识符(URI)方案，定义了 HTTP/1.1 消息语法和解析要求，并描述了实现的相关安全性问题。

source: This document specifies Version 1.2 of the Transport Layer Security (TLS) protocol.
zh_cn: 本文档指定了传输层安全性(TLS)协议的 1.2 版。

source: This document specifies an Internet standards track protocol for the Internet community, and requests discussion and suggestions for improvements.
zh_cn: 本文档为互联网社区指定了互联网标准跟踪协议，并请求讨论和改进建议。

source: This document specifies four content types: handshake, application_data, alert, and change_cipher_spec.
zh_cn: 本文档指定了四种内容类型：handshake，application_data，alert 和 change_cipher_spec。

source: This document specifies version 1.3 of the Transport Layer Security (TLS) protocol.
zh_cn: 本文档规定了传输层安全性(TLS)协议的 1.3 版。

source: This document supersedes and obsoletes previous versions of TLS, including version 1.2 [RFC5246].
zh_cn: 本文档取代并废弃以前版本的 TLS，包括版本 1.2 [RFC5246]。

source: This document updates RFC 5246 and RFC7525 in such as way that MD5 and SHA1 MUST NOT be used for digital signatures.
zh_cn: 本文档更新了 RFC 5246 和 RFC7525，其方式是 MD5 和 SHA1 不得用于数字签名。

source: This document updates RFCs 5705 and 6066, and obsoletes RFCs 5077, 5246, and 6961.
zh_cn: 本文档更新了 RFC 5705 和 6066，并废弃了 RFC 5077,5246 和 6961。

source: This document updates and merges "Uniform Resource Locators" [RFC1738] and "Relative Uniform Resource Locators" [RFC1808] in order to define a single, generic syntax for all URI.
zh_cn: 本文档更新并合并“统一资源定位符”[RFC1738] 和“相对统一资源定位符”[RFC1808]，以便为所有 URI 定义单个通用语法。

source: This document uses "DSA" to refer to the algorithm, "DSS" to refer to the standard, and it uses "DSS" in the code point definitions for historical continuity.
zh_cn: 本文档使用“DSA”表示算法，“DSS”表示标准，并在代码点定义中使用“DSS”表示历史连续性。

source: This document uses several registries that were originally created in [TLS1.1].
zh_cn: 本文档使用最初在 [TLS1.1] 创建了几个注册表。

source: This document will use the following terms: An observer subscribes to an Observable.
zh_cn: 本文档将使用以下术语：observer (观察者) subscribes (订阅) 到 Observable (可观察对象)。

source: This documentation accompanies its explanations with “marble diagrams.” Here is how marble diagrams represent Observables and transformations of Observables:
zh_cn: 本文档的说明会带有“marble 图”。以下是 marble 图如何表示 Observables 的 Observables 的转换：

source: This documentation groups information about the various operators and examples of their usage into the following pages:
zh_cn: 本文档将有关 各种操作符 的信息及其用法示例分组到以下页面中：
